# Задача № 1:
# За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров?
# При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.
# Input:
# n = 700
# m = 750
# Output:
# 2

print ('Сколько машина проезжает км за день? ');
n = int (input())
print ('Введите длину маршрута, км: ');
m = int (input())
print(f'Машина проедет {m} км за {(m + n -1)//n} дня(ей)')

# Задача № 3:
# В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами.
# За каждой партой может сидеть два учащихся. Известно количество учащихся в каждом из трех классов. Выведите наименьшее число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32

first = int (input('Первый класс >>> '))
sec = int (input('Второй класс >>> '))
thrd = int (input('Третий класс >>> '))
sum1 = (first + 1) // 2
sum2 = (sec + 1) // 2
sum3 = (thrd + 1) // 2
print (sum1 + sum2 + sum3)

# # Задача № 5:
# # Вагоны в электричке пронумерованы натуральными числами, начиная с 1
# # (при этом иногда вагоны нумеруются от «головы» поезда, а иногда – с «хвоста»;
# # это зависит от того, в какую сторону едет электричка). В каждом вагоне написан его номер.
# # Витя сел в i-й вагон от головы поезда и обнаружил, что его вагон имеет номер j.
# # Он хочет определить, сколько всего вагонов в электричке. Напишите программу, которая будет это делать или сообщать,
# # что без дополнительной информации это сделать невозможно.
# # Input: 3 4(ввод на разных строках)
# # Output: 6

n = int(input("порядковый номер вагона: "))
m = int(input("номер на вагоне: "))
if n - m == 0:
    c = 0
else:
    c = n + m - 1
print(c)

# Задача № 7:
# Дано натуральное число. Требуется определить, является ли год с данным номером високосным.
# Если год является високосным, то выведите YES, иначе выведите NO. Напомним, что в соответствии с григорианским календарем,
# год является високосным, если его номер кратен 4, но не кратен 100, а также если он кратен 400.
# Input: 2016
# Output: YES

i = int(input("Введите год: "))
if (i % 4 == 0 and i % 100 != 0) or (i % 400 == 0):
    print('YES')
else:
    print('NO')
